---
kind: method
id: M:Autodesk.Revit.DB.IndependentTag.GetTaggedReferences
zh: 标记、打标、标签
source: html/63a90870-6b37-57b2-26fe-6fa1e605a9da.htm
---
# Autodesk.Revit.DB.IndependentTag.GetTaggedReferences Method

**中文**: 标记、打标、标签

Get the host references of the tag.
 An array of all the tagged references.

## Syntax (C#)
```csharp
public IList<Reference> GetTaggedReferences()
```

## Remarks
The references can be to an element or subelement in a local or linked document.